#!user/bin/env python3
# coding=gbk
import re
import csv


def multiple_replace(text, idct):
#    rx = re.compile('|'.join(idct))
    dlist = list(idct.keys())

    for c in dlist:
        rx = re.compile(c)
        if rx.match(text) is not None:
            break
        else:
            continue
#    def one_xlat(match):
#       return idct[match.group(0)]

#    return rx.sub(one_xlat, text)
    return rx.sub(idct[c], text)

idct = {'.*东方明珠.*': '东方明珠塔','.*杜莎.*':'上海杜莎夫人蜡像馆','.*环球金融.*':'上海环球金融中心观光厅','.*朱家角.*':'上海朱家角古镇','.*金茂.*':'上海金茂大厦88层观光厅','.*水族馆.*':'上海海洋水族馆','.*南翔.*':'上海南翔景区','.*世纪公园.*':'上海世纪公园',
        '.*影视乐园.*':'上海影视乐园','.*宋庆龄.*':'上海宋庆龄故居纪念馆','.*欢乐谷.*':'上海欢乐谷','.*辰山.*':'辰山植物园','.*古猗.*':'上海古猗园','.*自然博物馆.*':'上海自然博物馆','.*上海中心.*': '上海中心上海之巅观光厅', '.*顾村公园.*':'上海宝山顾村公园',
        '.*动物园.*':'上海野生动物园','.*新场.*':'上海新场古镇','.*电影博物馆.*':'上海电影博物馆', '.*嘴鱼村.*': '上海金山嘴渔村','.*东平.*':'东平国家森林公园', '.*泰迪.*':'泰迪之家博物馆', '.*孙中山.*': '上海孙中山故居纪念馆', '.*鲁迅.*':'上海鲁迅故居', '.*城市规划.*':'上海城市规划展示馆',
        '.*枫泾.*':'上海枫泾古镇', '.*汽车.*':'上海汽车博物馆','.*大观园.*':'上海大观园','.*月湖雕塑.*':'上海月湖雕塑公园','.*长风.*':'上海长风海洋世界','.*锦江.*':'上海锦江乐园','.*鲜花港.*':'上海鲜花港','.*滨江森林.*':'上海滨江森林公园', '.*碧海金沙.*':'上海碧海金沙景区',
        '.*海湾.*':'上海海湾国家森林公园','.*炮台湾.*':'上海吴淞炮台湾湿地公园', '.*共青森林.*':'上海共青森林公园','.*醉白池.*':'上海醉白池公园','.*外滩.*':'外滩','.*南京路.*':'南京路步行街','.*迪士尼.*':'上海迪士尼','.*田子坊.*':'田子坊','.*豫园.*':'豫园',
        '.*1933.*':'1933老场坊','.*新天地.*':'新天地','.*陆家嘴.*':'陆家嘴','.*世博园.*':'上海世博园','.*七宝.*':'七宝老街','.*中共一大.*':'中共一大会址纪念馆'}

with open("TF.CSV", 'r', encoding="utf-8") as f:
    reader = csv.reader(f)
    rows = [row for row in reader]


with open("TF1.csv", 'a+', encoding="utf-8") as f1:
    for i in rows:
        b=[]
        for a in i:
            b.append(multiple_replace(a,idct))
        writer = csv.writer(f1, dialect='excel')
        writer.writerow(b)
